In [1]:
## PANDAS

In [2]:
import pandas as pd

In [3]:
print(pd.__version__)

2.1.1

In [57]:
a = pd.Series([2,3,4,5], index = ['a','b','c','d'])
a

a    2
b    3
c    4
d    5
dtype: int64

In [8]:
type(a.values)

numpy.ndarray

In [9]:
type(a)

pandas.core.series.Series

In [13]:
a.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [14]:
grades_dict = {'A':4, 'B':3.5,'C':3,'D':2.5}
grads = pd.Series(grades_dict)

In [15]:
grads.values

array([4. , 3.5, 3. , 2.5])

In [18]:
marks_dict = {'A':85,'B':75,'C':65,'D':55}
marks = pd.Series(marks_dict)

In [19]:
marks

A    85
B    75
C    65
D    55
dtype: int64

In [20]:
marks['A':'C']

A    85
B    75
C    65
dtype: int64

In [21]:
marks[0:3]

A    85
B    75
C    65
dtype: int64

In [22]:
marks[0:]

A    85
B    75
C    65
D    55
dtype: int64

In [30]:
d = pd.DataFrame({'Marks':marks, 'grads': grads})

In [33]:
d

   Marks  grads
A     85    4.0
B     75    3.5
C     65    3.0
D     55    2.5

In [39]:
d.values[0,1]

4.0

In [40]:
d.columns

Index(['Marks', 'grads'], dtype='object')

In [41]:
d.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [42]:
d['Scaled_Marks'] = 100*(d['Marks']/90)

In [43]:
d

   Marks  grads  Scaled_Marks
A     85    4.0     94.444444
B     75    3.5     83.333333
C     65    3.0     72.222222
D     55    2.5     61.111111

In [44]:
d['Addition']= d['Marks'] + d['grads']

In [45]:
d

   Marks  grads  Scaled_Marks  Addition
A     85    4.0     94.444444      89.0
B     75    3.5     83.333333      78.5
C     65    3.0     72.222222      68.0
D     55    2.5     61.111111      57.5

In [46]:
del d['Scaled_Marks']

In [47]:
d

   Marks  grads  Addition
A     85    4.0      89.0
B     75    3.5      78.5
C     65    3.0      68.0
D     55    2.5      57.5

In [48]:
g = d[d['Marks']>70]

In [49]:
g

   Marks  grads  Addition
A     85    4.0      89.0
B     75    3.5      78.5

In [54]:
gg = pd.DataFrame([{'a':1,'b':2}, {'b':3, 'c':4}])

In [55]:
## Nan :: Not a Number 

gg

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [56]:
gg.fillna(9)

     a  b    c
0  1.0  2  9.0
1  9.0  3  4.0